In [1]:
import numpy as np
import pandas as pd

### Connect Pandas to the database with this URL:

In [2]:
 titles = pd.read_csv('data/titles.csv')
 titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
 cast = pd.read_csv('data/cast.csv')
 cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [4]:
titles.dtypes

title    object
year      int64
dtype: object

In [5]:
cast.dtypes

title         object
year           int64
name          object
type          object
character     object
n            float64
dtype: object

### Using groupby(), count the number of films that have been released each decade in the history of cinema.

In [6]:
(10 * np.fix(1981/10)).astype(int)

1980

In [7]:
def add_decade(df):
    """Returns a new dataframe with the an extra columnn called decade that contains the decade of the movie."""
    
    df['decade'] = (10 * np.fix(df["year"] / 10)).astype(int)
    return df

In [8]:
df = titles.pipe(add_decade)
df.head()

                     title  year  decade
0           The Rising Son  1990    1990
1  The Thousand Plane Raid  1969    1960
2         Crucea de piatra  1993    1990
3                  Country  2000    2000
4               Gaiking II  2011    2010

In [9]:
# This is a check to see if the answer is correct.

df['decade'].value_counts().sort_index()

1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
Name: decade, dtype: int64

In [10]:
df.groupby('decade').size()

decade
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
dtype: int64

### Use groupby() count the number of "Hamlet" films made each decade.

In [11]:
df[df['title'] == "Hamlet"].groupby('decade').size()

decade
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
dtype: int64

In [12]:
df.groupby(['title', 'decade']).size()["Hamlet"]

decade
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
dtype: int64

In [13]:
df_h = df.groupby(['title', 'decade']).size()["Hamlet"]
df_h.reindex(range(1890, 2030, 10), fill_value=0)

decade
1890    0
1900    0
1910    3
1920    1
1930    0
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
2020    0
dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [14]:
cast.groupby(['year', 'type', 'n']).size().loc[1950:1959, 'actor', 1]

year  type   n
1950  actor  1.0    626
1951  actor  1.0    647
1952  actor  1.0    607
1953  actor  1.0    652
1954  actor  1.0    634
1955  actor  1.0    641
1956  actor  1.0    643
1957  actor  1.0    735
1958  actor  1.0    710
1959  actor  1.0    721
dtype: int64

In [15]:
cast.groupby(['year', 'type', 'n']).size().loc[1950:1959, 'actress', 1]

year  type     n
1950  actress  1.0    281
1951  actress  1.0    281
1952  actress  1.0    293
1953  actress  1.0    301
1954  actress  1.0    310
1955  actress  1.0    281
1956  actress  1.0    305
1957  actress  1.0    301
1958  actress  1.0    295
1959  actress  1.0    317
dtype: int64

### In the 1950s decade taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [16]:
c_df = cast.pipe(add_decade)
c_df.head()

,title,year,name,type,character,n,decade
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN,2010
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0,1980
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0,2010
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN,2010
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN,2010

In [17]:
c_df.groupby(['decade', 'type', 'n']).size().loc[1950, 'actor'].head()

n
1.0    6616
2.0    4564
3.0    5587
4.0    5594
5.0    5611
dtype: int64

In [18]:
c_df.groupby(['decade', 'type', 'n']).size().loc[1950, 'actress'].head()

n
1.0    2965
2.0    4556
3.0    3148
4.0    2849
5.0    2544
dtype: int64

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [31]:
cast_p = cast[cast['title'].str.contains("Pink Panther", case = False, regex = False)]
cast_p.head()

,title,year,name,type,character,n,decade
955,The Pink Panther,2006,William Abadie,actor,Bizu,11.0,2000
1978,Revenge of the Pink Panther,1978,Fredric Abbott,actor,Douvier's Soldier,38.0,1970
4691,Curse of the Pink Panther,1983,William Abney,actor,Hugo the Houseman,33.0,1980
12589,Son of the Pink Panther,1993,Tony Adams,actor,Wedding Guest,NaN,1990
12590,The Return of the Pink Panther,1975,Tony Adams,actor,Waiter,NaN,1970

In [32]:
cast_p.groupby(['year', 'title']).size()

year  title
1963  The Pink Panther                  21
1975  The Return of the Pink Panther    30
1976  The Pink Panther Strikes Again    68
1978  Revenge of the Pink Panther       64
1982  Trail of the Pink Panther         41
1983  Curse of the Pink Panther         67
1993  Son of the Pink Panther           46
2006  The Pink Panther                  90
2009  The Pink Panther 2                84
dtype: int64

In [33]:
len(cast[(cast["title"] == "The Pink Panther") & (cast["year"] == 1963)])

21

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [22]:
cast.groupby(['year', 'title', 'name']).size().loc[:, :,"Frank Oz"]

year  title
1979  The Muppet Movie                                  8
1980  Star Wars: Episode V - The Empire Strikes Back    1
      The Blues Brothers                                1
1981  An American Werewolf in London                    2
      The Great Muppet Caper                            6
1982  The Dark Crystal                                  2
1983  Star Wars: Episode VI - Return of the Jedi        1
      Superman III                                      1
      Trading Places                                    1
1984  The Muppets Take Manhattan                        7
1985  Follow That Bird                                  3
      Spies Like Us                                     1
1986  Labyrinth                                         1
1992  Innocent Blood                                    1
      The Muppet Christmas Carol                        7
1996  Muppet Treasure Island                            4
1998  Blues Brothers 2000                               1
1999  Muppets from Space                                4
      Star Wars: Episode I - The Phantom Menace         1
      The Adventures of Elmo in Grouchland              3
2001  Monsters, Inc.                                    1
2002  Star Wars: Episode II - Attack of the Clones      1
2005  Star Wars: Episode III - Revenge of the Sith      1
      Zathura: A Space Adventure                        1
2015  Inside Out                                        1
      Star Wars: Episode VII - The Force Awakens        1
dtype: int64

In [23]:
cast_Oz = cast.groupby(['year', 'title', 'name']).size().loc[:, :, "Frank Oz"]
cast_Oz[cast_Oz > 1]

year  title
1979  The Muppet Movie                        8
1981  An American Werewolf in London          2
      The Great Muppet Caper                  6
1982  The Dark Crystal                        2
1984  The Muppets Take Manhattan              7
1985  Follow That Bird                        3
1992  The Muppet Christmas Carol              7
1996  Muppet Treasure Island                  4
1999  Muppets from Space                      4
      The Adventures of Elmo in Grouchland    3
dtype: int64

### List each of the characters that Frank Oz has portrayed at least twice.

In [24]:
cast.groupby(['name', 'character']).size().loc["Frank Oz"]

character
Animal                                                  6
Aughra, a Keeper Of Secrets (performer)                 1
Bert                                                    3
Brain Surgeon                                           1
Chamberlain (performer)                                 1
Cookie Monster                                          3
Corrections Officer                                     1
Corrupt Cop                                             1
Doc Hopper's Men                                        1
Fozzie                                                  1
Fozzie Bear                                             4
Fozzie Bear as Fozziewig                                1
Fungus                                                  1
George the Janitor                                      1
Gramps                                                  1
Grover                                                  2
Horse and Carriage Driver                               1
Marvin Suggs                                            1
Miss Piggy                                              6
Miss Piggy as Emily Cratchit                            1
Motorcycle Guy                                          1
Mr. Collins                                             1
Ocean Breeze Soap Board Member                          1
Pathologist                                             1
Robot                                                   1
Sam the Eagle                                           5
Sam the Eagle as Headmaster of Junior High Graduates    1
Subconscious Guard Dave                                 1
Swedish Chef                                            1
Swedish Chef (assistant)                                1
Test Monitor                                            1
The Wiseman                                             1
Vegetable Salesman                                      1
Warden                                                  1
Yoda                                                    6
dtype: int64

In [25]:
cast_Oz_2 = cast.groupby(['name', 'character']).size().loc["Frank Oz"]
cast_Oz_2[cast_Oz_2 >= 2]

character
Animal            6
Bert              3
Cookie Monster    3
Fozzie Bear       4
Grover            2
Miss Piggy        6
Sam the Eagle     5
Yoda              6
dtype: int64